doc/request_bodies/get_all_customers_with_modified_since.xml

<?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://www.twinfield.com/" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:s="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:tns="http://www.twinfield.com/" xmlns:s1="http://microsoft.com/wsdl/types/" xmlns:tm="http://microsoft.com/wsdl/mime/textMatching/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"><soap:Header><Header xmlns="http://www.twinfield.com/"><SessionID>session_id</SessionID></Header></soap:Header><soap:Body><Search xmlns="http://www.twinfield.com/"><type>DIM</type><pattern>*</pattern><field>0</field><firstRow>1</firstRow><maxRows>10000</maxRows><options><ArrayOfString><string>dimtype</string><string>DEB</string></ArrayOfString><ArrayOfString><string>office</string><string>company</string></ArrayOfString><ArrayOfString><string>modifiedsince</string><string>20250101122232</string></ArrayOfString></options></Search></soap:Body></soap:Envelope>